src/InformationRegisters/ИзмененияСвойствОбъектовМетаданных/ИзмененияСвойствОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзмененияСвойствОбъектовМетаданных</name>
  <resources>
    <name>Изменение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВидИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСвойства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОчередьОповещенийИзмененияМетаданныхRMQ/ОчередьОповещенийИзмененияМетаданныхRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОповещенийИзмененияМетаданныхRMQ</name>
  <comment>для RabbitMQ</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОперацийОбработкиОчереди</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыОперацийОбработкиОчереди/СтатусыОперацийОбработкиОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОперацийОбработкиОчереди</name>
  <enumValues>
    <name>ОжидаетОбработки</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/ИзмененияСвойствОбъектовМетаданных/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	ЗаписатьИзмененияВОчередьОповещения();
	
КонецПроцедуры

Процедура ЗаписатьИзмененияВОчередьОповещения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИзмененияСвойств", ЭтотОбъект.Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ИзмененияСвойств.ВерсияХранилища КАК Справочник.ИсторияХранилища) КАК ВерсияХранилища,
		|	ИзмененияСвойств.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных
		|ПОМЕСТИТЬ ИзмененияСвойств
		|ИЗ
		|	&ИзмененияСвойств КАК ИзмененияСвойств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИзмененияСвойств.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных,
		|	ИзмененияСвойств.ВерсияХранилища.Владелец.Владелец КАК Конфигурация
		|ИЗ
		|	ИзмененияСвойств КАК ИзмененияСвойств";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Менеджер = РегистрыСведений.ОчередьОповещенийИзмененияМетаданныхRMQ.СоздатьМенеджерЗаписи();
		Менеджер.Период = ТекущаяДатаСеанса();
		Менеджер.Конфигурация = Выборка.Конфигурация;
		Менеджер.ИмяОбъектаМетаданных = Выборка.ИмяОбъектаМетаданных;
		Менеджер.Статус = Перечисления.СтатусыОперацийОбработкиОчереди.ОжидаетОбработки;
		Менеджер.Записать();
	КонецЦикла;
		
КонецПроцедуры
